src/test/resources/artifacts/ESB/config/soapRequests/salesforce/apiDescribeSObjectMandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:urn="urn:partner.soap.sforce.com">
    <soapenv:Header>
        <urn:SessionHeader>
            <urn:sessionId>%s(session)</urn:sessionId>
        </urn:SessionHeader>
    </soapenv:Header>
    <soapenv:Body>
        <urn:describeSObject>
            <urn:sObjectType>%s(sobject)</urn:sObjectType>
        </urn:describeSObject>
    </soapenv:Body>
</soapenv:Envelope>