carbon/platform/branches/turing/components/mediation/mediation-library/connectors/org.wso2.carbon.connector.salesforce/4.2.0/src/main/resources/salesforce/describeSObject.xml

<?xml version="1.0" encoding="UTF-8"?>
<template name="describeSobject" xmlns="http://ws.apache.org/ns/synapse">
    <parameter name="sobject"/>
    <sequence>
        <property
            expression="get-property('operation','salesforce.serviceUrl')" name="uri.var.salesforce.url"/>
        <payloadFactory>
            <format>
                <soapenv:Envelope
                    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:partner.soap.sforce.com">
                    <soapenv:Header>
                        <urn:SessionHeader>
                            <urn:sessionId>$1</urn:sessionId>
                        </urn:SessionHeader>
                    </soapenv:Header>
                    <soapenv:Body>
                        <urn:describeSObject>
                            <urn:sObjectType>$2</urn:sObjectType>
                        </urn:describeSObject>
                    </soapenv:Body>
                </soapenv:Envelope>
            </format>
            <args>
                <arg expression="get-property('operation','salesforce.sessionId')"/>
                <arg expression="$func:sobject"/>
            </args>
        </payloadFactory>
        <property name="SOAPAction" scope="transport" value="urn:partner.soap.sforce.com/Soap/describeSObjectRequest"/>
        <call>
            <endpoint>
                <http method="POST" uri-template="{uri.var.salesforce.url}"/>
            </endpoint>
        </call>
    </sequence>
</template>
